ISouthRain/HC32F448-template/.pack/HDSC/HC32F448.1.0.1/SVD/HC32F448KATI.svd
                <register>
                    <name>CHCTL5</name>
                    <description>desc CHCTL5</description>
                    <addressOffset>0x19C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SINC</name>
                            <description>desc SINC</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DINC</name>
                            <description>desc DINC</description>
                            <msb>3</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SRPTEN</name>
                            <description>desc SRPTEN</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DRPTEN</name>
                            <description>desc DRPTEN</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SNSEQEN</name>
                            <description>desc SNSEQEN</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DNSEQEN</name>
                            <description>desc DNSEQEN</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HSIZE</name>
                            <description>desc HSIZE</description>
                            <msb>9</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LLPEN</name>
                            <description>desc LLPEN</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LLPRUN</name>
                            <description>desc LLPRUN</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IE</name>
                            <description>desc IE</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HPROT</name>
                            <description>desc HPROT</description>
                            <msb>15</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MONSAR5</name>
                    <description>desc MONSAR5</description>
                    <addressOffset>0x1A0</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>MONDAR5</name>
                    <description>desc MONDAR5</description>
                    <addressOffset>0x1A4</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>MONDTCTL5</name>
                    <description>desc MONDTCTL5</description>
                    <addressOffset>0x1A8</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x1</resetValue>
                    <resetMask>0xFFFF03FF</resetMask>
                    <fields>
                        <field>
                            <name>BLKSIZE</name>
                            <description>desc BLKSIZE</description>
                            <msb>9</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CNT</name>
                            <description>desc CNT</description>
                            <msb>31</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MONRPT5</name>
                    <description>desc MONRPT5</description>
                    <addressOffset>0x1AC</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3FF03FF</resetMask>
                    <fields>
                        <field>
                            <name>SRPT</name>
                            <description>desc SRPT</description>
                            <msb>9</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DRPT</name>
                            <description>desc DRPT</description>
                            <msb>25</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MONSNSEQCTL5</name>
                    <description>desc MONSNSEQCTL5</description>
                    <addressOffset>0x1B0</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SOFFSET</name>
                            <description>desc SOFFSET</description>
                            <msb>19</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SNSCNT</name>
                            <description>desc SNSCNT</description>
                            <msb>31</msb>
                            <lsb>20</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MONDNSEQCTL5</name>
                    <description>desc MONDNSEQCTL5</description>
                    <addressOffset>0x1B4</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>DOFFSET</name>
                            <description>desc DOFFSET</description>
                            <msb>19</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DNSCNT</name>
                            <description>desc DNSCNT</description>
                            <msb>31</msb>
                            <lsb>20</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
