ISouthRain/HC32F448-template/.pack/HDSC/HC32F448.1.0.1/SVD/HC32F448KATI.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>USART1</name>
            <description>desc USART</description>
            <baseAddress>0x4001CC00</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x1C</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>SR</name>
                    <description>desc SR</description>
                    <addressOffset>0x0</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0xC0</resetValue>
                    <resetMask>0x109EB</resetMask>
                    <fields>
                        <field>
                            <name>PE</name>
                            <description>desc PE</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FE</name>
                            <description>desc FE</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ORE</name>
                            <description>desc ORE</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RXNE</name>
                            <description>desc RXNE</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TC</name>
                            <description>desc TC</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TXE</name>
                            <description>desc TXE</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RTOF</name>
                            <description>desc RTOF</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TEND</name>
                            <description>desc TEND</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>MPB</name>
                            <description>desc MPB</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TDR</name>
                    <description>desc TDR</description>
                    <addressOffset>0x4</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x1FF</resetValue>
                    <resetMask>0x3FF</resetMask>
                    <fields>
                        <field>
                            <name>TDR</name>
                            <description>desc TDR</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MPID</name>
                            <description>desc MPID</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RDR</name>
                    <description>desc RDR</description>
                    <addressOffset>0x6</addressOffset>
                    <size>16</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>RDR</name>
                            <description>desc RDR</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BRR</name>
                    <description>desc BRR</description>
                    <addressOffset>0x8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFFFF</resetValue>
                    <resetMask>0xFF7F</resetMask>
                    <fields>
                        <field>
                            <name>DIV_FRACTION</name>
                            <description>desc DIV_FRACTION</description>
                            <msb>6</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DIV_INTEGER</name>
                            <description>desc DIV_INTEGER</description>
                            <msb>15</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CR1</name>
                    <description>desc CR1</description>
                    <addressOffset>0xC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x80000000</resetValue>
                    <resetMask>0xF31B97FF</resetMask>
                    <fields>
                        <field>
                            <name>RTOE</name>
                            <description>desc RTOE</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RTOIE</name>
                            <description>desc RTOIE</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RE</name>
                            <description>desc RE</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TE</name>
                            <description>desc TE</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SLME</name>
                            <description>desc SLME</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RIE</name>
                            <description>desc RIE</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TCIE</name>
                            <description>desc TCIE</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TXEIE</name>
                            <description>desc TXEIE</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TENDIE</name>
                            <description>desc TENDIE</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PS</name>
                            <description>desc PS</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PCE</name>
                            <description>desc PCE</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>M</name>
                            <description>desc M</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OVER8</name>
                            <description>desc OVER8</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CPE</name>
                            <description>desc CPE</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CFE</name>
                            <description>desc CFE</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CORE</name>
                            <description>desc CORE</description>
                            <msb>19</msb>
                            <lsb>19</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CRTOF</name>
                            <description>desc CRTOF</description>
                            <msb>20</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MS</name>
                            <description>desc MS</description>
                            <msb>24</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CTEND</name>
                            <description>desc CTEND</description>
                            <msb>25</msb>
                            <lsb>25</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ML</name>
                            <description>desc ML</description>
                            <msb>28</msb>
                            <lsb>28</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FBME</name>
                            <description>desc FBME</description>
                            <msb>29</msb>
                            <lsb>29</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NFE</name>
                            <description>desc NFE</description>
                            <msb>30</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SBS</name>
                            <description>desc SBS</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CR2</name>
                    <description>desc CR2</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x600</resetValue>
                    <resetMask>0x3801</resetMask>
                    <fields>
                        <field>
                            <name>MPE</name>
                            <description>desc MPE</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLKC</name>
                            <description>desc CLKC</description>
                            <msb>12</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>STOP</name>
                            <description>desc STOP</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CR3</name>
                    <description>desc CR3</description>
                    <addressOffset>0x14</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xE00328</resetMask>
                    <fields>
                        <field>
                            <name>HDSEL</name>
                            <description>desc HDSEL</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SCEN</name>
                            <description>desc SCEN</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RTSE</name>
                            <description>desc RTSE</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CTSE</name>
                            <description>desc CTSE</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BCN</name>
                            <description>desc BCN</description>
                            <msb>23</msb>
                            <lsb>21</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PR</name>
                    <description>desc PR</description>
                    <addressOffset>0x18</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x13</resetMask>
                    <fields>
                        <field>
                            <name>PSC</name>
                            <description>desc PSC</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ULBREN</name>
                            <description>desc ULBREN</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
